Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam
The serialization structure for AnalysisCompositeBeam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._Composite
This indicates if the beam is composite.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._SlabMaterial
The slab material of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._SlabThickness
The thickness of the slab of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._SlabWidthLeft
The left width of the slab of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._SlabWidthRight
The right width of the slab of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._ConcreteStrength
The strength of the conrete of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._RibHeight
The height of the rib of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._RibWidth
The width of the rib of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._RibDirection
The direction of the rib of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._StudDiameter
The diameter of the stud of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam._StudLength
The length of the stud of the analysis composite beam.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam.ToStruct(Tekla.Structures.Analysis.AnalysisCompositeBeam)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisCompositeBeam.FromStruct(Tekla.Structures.Analysis.AnalysisCompositeBeam)
DO NOT USE! For internal usage only!
P: P.